; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p12---int100n150-m25---int100c200---s483---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level14 level14)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level14 level15)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level14 level16)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level14 level17)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level25 level28)
(sum level4 level2 level6)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level14 level18)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level25 level29)
(sum level5 level2 level7)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level14 level19)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level25 level30)
(sum level6 level2 level8)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level14 level20)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level25 level31)
(sum level7 level2 level9)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level14 level21)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level25 level32)
(sum level8 level2 level10)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level14 level22)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level25 level33)
(sum level9 level2 level11)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level14 level23)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level25 level34)
(sum level10 level2 level12)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level14 level24)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level25 level35)
(sum level11 level2 level13)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level14 level25)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level25 level36)
(sum level12 level2 level14)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level14 level26)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level25 level37)
(sum level13 level2 level15)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level14 level27)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level25 level38)
(sum level14 level2 level16)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level14 level28)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level25 level39)
(sum level15 level2 level17)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level14 level29)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level25 level40)
(sum level16 level2 level18)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level14 level30)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level25 level41)
(sum level17 level2 level19)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level14 level31)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level25 level42)
(sum level18 level2 level20)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level14 level32)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level25 level43)
(sum level19 level2 level21)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level14 level33)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level25 level44)
(sum level20 level2 level22)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level14 level34)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level25 level45)
(sum level21 level2 level23)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level14 level35)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level25 level46)
(sum level22 level2 level24)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level14 level36)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level25 level47)
(sum level23 level2 level25)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level14 level37)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level25 level48)
(sum level24 level2 level26)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level14 level38)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level25 level49)
(sum level25 level2 level27)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level14 level39)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level25 level50)
(sum level26 level2 level28)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level14 level40)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level25 level51)
(sum level27 level2 level29)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level14 level41)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level25 level52)
(sum level28 level2 level30)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level14 level42)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level25 level53)
(sum level29 level2 level31)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level14 level43)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level25 level54)
(sum level30 level2 level32)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level14 level44)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level25 level55)
(sum level31 level2 level33)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level14 level45)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level25 level56)
(sum level32 level2 level34)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level14 level46)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level25 level57)
(sum level33 level2 level35)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level14 level47)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level25 level58)
(sum level34 level2 level36)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level14 level48)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level25 level59)
(sum level35 level2 level37)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level14 level49)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level25 level60)
(sum level36 level2 level38)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level14 level50)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level25 level61)
(sum level37 level2 level39)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level14 level51)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level25 level62)
(sum level38 level2 level40)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level14 level52)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level25 level63)
(sum level39 level2 level41)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level14 level53)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level25 level64)
(sum level40 level2 level42)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level14 level54)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level25 level65)
(sum level41 level2 level43)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level14 level55)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level25 level66)
(sum level42 level2 level44)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level14 level56)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level25 level67)
(sum level43 level2 level45)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level14 level57)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level25 level68)
(sum level44 level2 level46)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level14 level58)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level25 level69)
(sum level45 level2 level47)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level14 level59)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level25 level70)
(sum level46 level2 level48)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level14 level60)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level25 level71)
(sum level47 level2 level49)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level14 level61)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level25 level72)
(sum level48 level2 level50)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level14 level62)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level25 level73)
(sum level49 level2 level51)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level14 level63)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level25 level74)
(sum level50 level2 level52)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level14 level64)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level25 level75)
(sum level51 level2 level53)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level14 level65)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level25 level76)
(sum level52 level2 level54)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level14 level66)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level25 level77)
(sum level53 level2 level55)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level14 level67)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level25 level78)
(sum level54 level2 level56)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level14 level68)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level25 level79)
(sum level55 level2 level57)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level14 level69)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level55 level25 level80)
(sum level56 level2 level58)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level14 level70)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level56 level25 level81)
(sum level57 level2 level59)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level14 level71)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level57 level25 level82)
(sum level58 level2 level60)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level14 level72)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level58 level25 level83)
(sum level59 level2 level61)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level14 level73)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level59 level25 level84)
(sum level60 level2 level62)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level14 level74)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level60 level25 level85)
(sum level61 level2 level63)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level14 level75)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level61 level25 level86)
(sum level62 level2 level64)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level14 level76)
(sum level62 level17 level79)
(sum level62 level18 level80)
(sum level62 level25 level87)
(sum level63 level2 level65)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level14 level77)
(sum level63 level17 level80)
(sum level63 level18 level81)
(sum level63 level25 level88)
(sum level64 level2 level66)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level14 level78)
(sum level64 level17 level81)
(sum level64 level18 level82)
(sum level64 level25 level89)
(sum level65 level2 level67)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level14 level79)
(sum level65 level17 level82)
(sum level65 level18 level83)
(sum level65 level25 level90)
(sum level66 level2 level68)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level14 level80)
(sum level66 level17 level83)
(sum level66 level18 level84)
(sum level66 level25 level91)
(sum level67 level2 level69)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level67 level14 level81)
(sum level67 level17 level84)
(sum level67 level18 level85)
(sum level67 level25 level92)
(sum level68 level2 level70)
(sum level68 level7 level75)
(sum level68 level8 level76)
(sum level68 level14 level82)
(sum level68 level17 level85)
(sum level68 level18 level86)
(sum level68 level25 level93)
(sum level69 level2 level71)
(sum level69 level7 level76)
(sum level69 level8 level77)
(sum level69 level14 level83)
(sum level69 level17 level86)
(sum level69 level18 level87)
(sum level69 level25 level94)
(sum level70 level2 level72)
(sum level70 level7 level77)
(sum level70 level8 level78)
(sum level70 level14 level84)
(sum level70 level17 level87)
(sum level70 level18 level88)
(sum level70 level25 level95)
(sum level71 level2 level73)
(sum level71 level7 level78)
(sum level71 level8 level79)
(sum level71 level14 level85)
(sum level71 level17 level88)
(sum level71 level18 level89)
(sum level71 level25 level96)
(sum level72 level2 level74)
(sum level72 level7 level79)
(sum level72 level8 level80)
(sum level72 level14 level86)
(sum level72 level17 level89)
(sum level72 level18 level90)
(sum level72 level25 level97)
(sum level73 level2 level75)
(sum level73 level7 level80)
(sum level73 level8 level81)
(sum level73 level14 level87)
(sum level73 level17 level90)
(sum level73 level18 level91)
(sum level73 level25 level98)
(sum level74 level2 level76)
(sum level74 level7 level81)
(sum level74 level8 level82)
(sum level74 level14 level88)
(sum level74 level17 level91)
(sum level74 level18 level92)
(sum level74 level25 level99)
(sum level75 level2 level77)
(sum level75 level7 level82)
(sum level75 level8 level83)
(sum level75 level14 level89)
(sum level75 level17 level92)
(sum level75 level18 level93)
(sum level75 level25 level100)
(sum level76 level2 level78)
(sum level76 level7 level83)
(sum level76 level8 level84)
(sum level76 level14 level90)
(sum level76 level17 level93)
(sum level76 level18 level94)
(sum level76 level25 level101)
(sum level77 level2 level79)
(sum level77 level7 level84)
(sum level77 level8 level85)
(sum level77 level14 level91)
(sum level77 level17 level94)
(sum level77 level18 level95)
(sum level77 level25 level102)
(sum level78 level2 level80)
(sum level78 level7 level85)
(sum level78 level8 level86)
(sum level78 level14 level92)
(sum level78 level17 level95)
(sum level78 level18 level96)
(sum level78 level25 level103)
(sum level79 level2 level81)
(sum level79 level7 level86)
(sum level79 level8 level87)
(sum level79 level14 level93)
(sum level79 level17 level96)
(sum level79 level18 level97)
(sum level79 level25 level104)
(sum level80 level2 level82)
(sum level80 level7 level87)
(sum level80 level8 level88)
(sum level80 level14 level94)
(sum level80 level17 level97)
(sum level80 level18 level98)
(sum level80 level25 level105)
(sum level81 level2 level83)
(sum level81 level7 level88)
(sum level81 level8 level89)
(sum level81 level14 level95)
(sum level81 level17 level98)
(sum level81 level18 level99)
(sum level81 level25 level106)
(sum level82 level2 level84)
(sum level82 level7 level89)
(sum level82 level8 level90)
(sum level82 level14 level96)
(sum level82 level17 level99)
(sum level82 level18 level100)
(sum level82 level25 level107)
(sum level83 level2 level85)
(sum level83 level7 level90)
(sum level83 level8 level91)
(sum level83 level14 level97)
(sum level83 level17 level100)
(sum level83 level18 level101)
(sum level83 level25 level108)
(sum level84 level2 level86)
(sum level84 level7 level91)
(sum level84 level8 level92)
(sum level84 level14 level98)
(sum level84 level17 level101)
(sum level84 level18 level102)
(sum level84 level25 level109)
(sum level85 level2 level87)
(sum level85 level7 level92)
(sum level85 level8 level93)
(sum level85 level14 level99)
(sum level85 level17 level102)
(sum level85 level18 level103)
(sum level85 level25 level110)
(sum level86 level2 level88)
(sum level86 level7 level93)
(sum level86 level8 level94)
(sum level86 level14 level100)
(sum level86 level17 level103)
(sum level86 level18 level104)
(sum level86 level25 level111)
(sum level87 level2 level89)
(sum level87 level7 level94)
(sum level87 level8 level95)
(sum level87 level14 level101)
(sum level87 level17 level104)
(sum level87 level18 level105)
(sum level87 level25 level112)
(sum level88 level2 level90)
(sum level88 level7 level95)
(sum level88 level8 level96)
(sum level88 level14 level102)
(sum level88 level17 level105)
(sum level88 level18 level106)
(sum level88 level25 level113)
(sum level89 level2 level91)
(sum level89 level7 level96)
(sum level89 level8 level97)
(sum level89 level14 level103)
(sum level89 level17 level106)
(sum level89 level18 level107)
(sum level89 level25 level114)
(sum level90 level2 level92)
(sum level90 level7 level97)
(sum level90 level8 level98)
(sum level90 level14 level104)
(sum level90 level17 level107)
(sum level90 level18 level108)
(sum level90 level25 level115)
(sum level91 level2 level93)
(sum level91 level7 level98)
(sum level91 level8 level99)
(sum level91 level14 level105)
(sum level91 level17 level108)
(sum level91 level18 level109)
(sum level91 level25 level116)
(sum level92 level2 level94)
(sum level92 level7 level99)
(sum level92 level8 level100)
(sum level92 level14 level106)
(sum level92 level17 level109)
(sum level92 level18 level110)
(sum level92 level25 level117)
(sum level93 level2 level95)
(sum level93 level7 level100)
(sum level93 level8 level101)
(sum level93 level14 level107)
(sum level93 level17 level110)
(sum level93 level18 level111)
(sum level93 level25 level118)
(sum level94 level2 level96)
(sum level94 level7 level101)
(sum level94 level8 level102)
(sum level94 level14 level108)
(sum level94 level17 level111)
(sum level94 level18 level112)
(sum level94 level25 level119)
(sum level95 level2 level97)
(sum level95 level7 level102)
(sum level95 level8 level103)
(sum level95 level14 level109)
(sum level95 level17 level112)
(sum level95 level18 level113)
(sum level95 level25 level120)
(sum level96 level2 level98)
(sum level96 level7 level103)
(sum level96 level8 level104)
(sum level96 level14 level110)
(sum level96 level17 level113)
(sum level96 level18 level114)
(sum level97 level2 level99)
(sum level97 level7 level104)
(sum level97 level8 level105)
(sum level97 level14 level111)
(sum level97 level17 level114)
(sum level97 level18 level115)
(sum level98 level2 level100)
(sum level98 level7 level105)
(sum level98 level8 level106)
(sum level98 level14 level112)
(sum level98 level17 level115)
(sum level98 level18 level116)
(sum level99 level2 level101)
(sum level99 level7 level106)
(sum level99 level8 level107)
(sum level99 level14 level113)
(sum level99 level17 level116)
(sum level99 level18 level117)
(sum level100 level2 level102)
(sum level100 level7 level107)
(sum level100 level8 level108)
(sum level100 level14 level114)
(sum level100 level17 level117)
(sum level100 level18 level118)
(sum level101 level2 level103)
(sum level101 level7 level108)
(sum level101 level8 level109)
(sum level101 level14 level115)
(sum level101 level17 level118)
(sum level101 level18 level119)
(sum level102 level2 level104)
(sum level102 level7 level109)
(sum level102 level8 level110)
(sum level102 level14 level116)
(sum level102 level17 level119)
(sum level102 level18 level120)
(sum level103 level2 level105)
(sum level103 level7 level110)
(sum level103 level8 level111)
(sum level103 level14 level117)
(sum level103 level17 level120)
(sum level104 level2 level106)
(sum level104 level7 level111)
(sum level104 level8 level112)
(sum level104 level14 level118)
(sum level105 level2 level107)
(sum level105 level7 level112)
(sum level105 level8 level113)
(sum level105 level14 level119)
(sum level106 level2 level108)
(sum level106 level7 level113)
(sum level106 level8 level114)
(sum level106 level14 level120)
(sum level107 level2 level109)
(sum level107 level7 level114)
(sum level107 level8 level115)
(sum level108 level2 level110)
(sum level108 level7 level115)
(sum level108 level8 level116)
(sum level109 level2 level111)
(sum level109 level7 level116)
(sum level109 level8 level117)
(sum level110 level2 level112)
(sum level110 level7 level117)
(sum level110 level8 level118)
(sum level111 level2 level113)
(sum level111 level7 level118)
(sum level111 level8 level119)
(sum level112 level2 level114)
(sum level112 level7 level119)
(sum level112 level8 level120)
(sum level113 level2 level115)
(sum level113 level7 level120)
(sum level114 level2 level116)
(sum level115 level2 level117)
(sum level116 level2 level118)
(sum level117 level2 level119)
(sum level118 level2 level120)

(connected l0 l1)
(fuelcost level7 l0 l1)
(connected l0 l3)
(fuelcost level14 l0 l3)
(connected l1 l0)
(fuelcost level7 l1 l0)
(connected l1 l2)
(fuelcost level18 l1 l2)
(connected l1 l4)
(fuelcost level2 l1 l4)
(connected l2 l1)
(fuelcost level18 l2 l1)
(connected l2 l3)
(fuelcost level25 l2 l3)
(connected l2 l4)
(fuelcost level8 l2 l4)
(connected l3 l0)
(fuelcost level14 l3 l0)
(connected l3 l2)
(fuelcost level25 l3 l2)
(connected l3 l4)
(fuelcost level17 l3 l4)
(connected l4 l1)
(fuelcost level2 l4 l1)
(connected l4 l2)
(fuelcost level8 l4 l2)
(connected l4 l3)
(fuelcost level17 l4 l3)

(at t0 l2)
(fuel t0 level120)
(= (total-cost) 0)

(at p0 l2)
(at p1 l4)
(at p2 l2)
(at p3 l1)
(at p4 l1)
(at p5 l1)
(at p6 l0)
(at p7 l3)
(at p8 l0)
(at p9 l4)
(at p10 l2)
(at p11 l4)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l4)
(at p3 l4)
(at p4 l3)
(at p5 l4)
(at p6 l4)
(at p7 l0)
(at p8 l1)
(at p9 l0)
(at p10 l4)
(at p11 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 12
2. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 0 of 12
3. (drive t0 l2 l4 level112 level8 level120)
   deleted: (at t0 l2) (fuel t0 level120)
   added: (at t0 l4) (fuel t0 level112)
   goals met: 0 of 12
4. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 1 of 12
5. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 2 of 12
6. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 2 of 12
7. (load p11 t0 l4)
   deleted: (at p11 l4)
   added: (in p11 t0)
   goals met: 2 of 12
8. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 2 of 12
9. (drive t0 l4 l2 level104 level8 level112)
   deleted: (at t0 l4) (fuel t0 level112)
   added: (at t0 l2) (fuel t0 level104)
   goals met: 2 of 12
10. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 3 of 12
11. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 3 of 12
12. (drive t0 l2 l3 level79 level25 level104)
   deleted: (at t0 l2) (fuel t0 level104)
   added: (at t0 l3) (fuel t0 level79)
   goals met: 3 of 12
13. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 3 of 12
14. (drive t0 l3 l0 level65 level14 level79)
   deleted: (at t0 l3) (fuel t0 level79)
   added: (at t0 l0) (fuel t0 level65)
   goals met: 3 of 12
15. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 4 of 12
16. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 5 of 12
17. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 5 of 12
18. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 5 of 12
19. (drive t0 l0 l1 level58 level7 level65)
   deleted: (at t0 l0) (fuel t0 level65)
   added: (at t0 l1) (fuel t0 level58)
   goals met: 5 of 12
20. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 5 of 12
21. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 5 of 12
22. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 5 of 12
23. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 6 of 12
24. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 7 of 12
25. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 8 of 12
26. (drive t0 l1 l4 level56 level2 level58)
   deleted: (at t0 l1) (fuel t0 level58)
   added: (at t0 l4) (fuel t0 level56)
   goals met: 8 of 12
27. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 9 of 12
28. (unload p5 t0 l4)
   deleted: (in p5 t0)
   added: (at p5 l4)
   goals met: 10 of 12
29. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 11 of 12
30. (drive t0 l4 l3 level39 level17 level56)
   deleted: (at t0 l4) (fuel t0 level56)
   added: (at t0 l3) (fuel t0 level39)
   goals met: 11 of 12
31. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 12 of 12
